tests/playlistArtillery/add.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 20
scenarios:
  - flow:
      - post:
          url: "/users"
          json:
            username: "Test"
            email: "{{ $randomString() }}"
            password: "Password123"
          capture:
            - json: $.token
              as: "token"
            - json: $.user.email
              as: "randomEmail"  
            - json: $.user._id
              as: "userId"   
      - post:
          url: "/users/login"
          headers:
            Authorization: "Bearer {{token}}"
          json:
            email: "{{randomEmail}}"
            password: "Password123"
      - post:
          url: "/playlists"
          headers:
            Authorization: "Bearer {{token}}"
          json:
            title: "test"
            description: "testing"
          capture:
            - json: $.playlists[0]._id
              as: "playlistId"
            - exec: console.log("Playlist ID:", {{playlistId}})      
      - post:
          url: "/playlists/add/{{playlistId}}"
          headers:
            Authorization: "Bearer {{token}}"
          json:
            artistName: "Bad Bunny"
            songTitle: "U"